const languageMap = {

  '搜索': '搜索',
  '精选产品': '精选',
  '最新产品': '最新',
  '促销产品': '促销',
  '查看所有产品': '查看所有',
  '加入购物车': '加入购物车',
  '产品参数': '产品参数',
  '相关产品': '相关',
  '选择选项': '选择选项',
  '缺货': '缺货',
  '促销': '促销',
  '详情': '详情',
  '首页': '首页',
  '购物车': '购物车',
  '客服': '客服',
  '加入购物车': '加入购物车',
  '产品属性': '产品属性',
  '无产品属性': '无产品属性',
  '确定': '确定',
  '特色': '特色',
  '购物车空空的': '购物车空空的',
  '随便逛逛': '随便逛逛',
  '合计: ': '合计: ',
  '不含运费': '不含运费',
  '结算': '结算',
  '我的订单': '我的订单',
  '联系我们': '联系我们',
  '设置语言': '设置语言',

  '订单详情': '订单详情',
  '分类': '分类',
  '我的': '我的',

  '所有产品': '所有产品',

  '没有更多了~': '没有更多了~',

  '所有订单': '所有订单',
  '待付款': '待付款',
  '待发货': '待发货',
  '已发货': '已发货',
  '已完成': '已完成',
  '已取消': '已取消',
  '取消成功': '取消成功',
  '取消失败，请稍后再试': '取消失败，请稍后再试',
  '支付成功': '支付成功',
  '支付暂时出现问题，请稍候再试': '支付暂时出现问题，请稍候再试',
  '还没有相关订单': '还没有相关订单',
  '件商品': '件商品',
  '合计': '合计',
  '运费': '运费',
  '待发货': '待发货',
  '已完成': '已完成',

  '小计': '小计',
  '优惠券': '优惠券',
  '手续费': '手续费',
  '交易号': '交易号',
  '订单号': '订单号',
  '创建时间': '创建时间',
  '付款时间': '付款时间',
  '取消订单': '取消订单',
  '立即付款': '立即付款',
  '联系客服': '联系客服',

  '配送方式': '配送方式',
  '暂无可用配送方式': '暂无可用配送方式',
  '无需物流': '无需物流',
  '暂不支持': '暂不支持',
  '已用': '已用',
  '张': '张',
  '未使用': '未使用',
  '货到付款': '货到付款',
  '留言': '留言',
  '优惠': '优惠',
  '提交订单': '提交订单',

  '扫码点餐': '扫码点餐',
  '请点击登录': '请点击登录',

  '正在加载': '正在加载',
  '加载失败，请尝试刷新': '加载失败，请尝试刷新',
  '欢迎开始点餐': '欢迎开始点餐~',

  '还没有相关产品': '还没有相关产品',

}

module.exports = {

  languageMap: languageMap

}